

namespace EfficiencyHub.Common.Enums
{
    public enum ProjectRole
    {
        /// <summary>
        /// Има пълен достъп до проекта, включително създаване и управление на задачи, и управление на екипа.
        /// </summary>
        ProjectManager,

        /// <summary>
        /// Има достъп до създаване и изпълнение на задачи, но с ограничени права за управление на екипа.
        /// </summary>
        TeamLead,

        /// <summary>
        /// Работи върху задачи, които са му възложени, без да има права за управление на проекта или екипа.
        /// </summary>
        Contributor,

        /// <summary>
        /// Може само да разглежда проекта и задачите, без да има право да прави промени.
        /// </summary>
        Viewer,

        /// <summary>
        /// Има разрешение да редактира съдържанието на задачите и проекта, но не и за създаване или изтриване на задачи.
        /// </summary>
        Editor

    }
}
